Repository: evildmp/diataxis-documentation-framework
Catalog: locales/*/LC_MESSAGES/index.po
Languages: pt_br

source: Home
pt_br: Início

source: The Diátaxis framework solves the problem of structure in technical documentation, making it easier to create, maintain and use.
pt_br: O framework Diátaxis resolve o problema de como estrutuar documentação técnica, fazendo com que seja fácil de manter e de usar.

source: documentation, four, kinds
pt_br: documentação, quatro, tipos

source: Diátaxis Framework
pt_br: Framework Diátaxis

source: A systematic framework for technical documentation authoring.
pt_br: Um framework sistemático para autoria de documentação técnica.

source: The Diátaxis framework aims to solve the problem of structure in technical documentation. It adopts a systematic approach to understanding the needs of documentation users in their cycle of interaction with a product.
pt_br: O framework Diátaxis tem como objeto resolver o problema de estrutura em documentações técnicas. Ele adota uma abordagem sistemática para entender a necessidade da documentação dos usuários em seus ciclos de interação com um produto.

source: The Grand Unified Theory of Documentation
pt_br: A Grande Teoria Unificada sobre Documentação

source: From the Ancient Greek δῐᾰ́τᾰξῐς - *dia*, "across", and *taxis*, "arrangement".
pt_br: Do Grego Antigo δῐᾰ́τᾰξῐς - *dia*, "através", e *taxis*, "arranjo".

source: The framework identifies four modes of documentation - **tutorials**, **how-to guides**, **technical reference** and **explanation**.
pt_br: O framework identifica quatro modos de documentação - **tutoriais**, **guias de como-fazer**, **referência técnica** e **explicação**

source: Each of these modes (or types) answers to a different user need, fulfils a different purpose and requires a different approach to its creation.
pt_br: Cada um desses modos (ou tipos) corresponde a uma necessidade diferente do usuário, preenche um propósito diferente e requer uma abordagem distinta para sua criação.

source: In other words, what we call *documentation* is fundamentally not one thing, but four. Understanding the implications of this will help improve most documentation - often immensely.
pt_br: Em outras palavras, o que nós chamamos *documentação* não é fundamentalmente uma coisa só, mas quatro. Compreender essas implicações vai ajudar a melhorar bastante a documentação - muitas vezes imensamente.

source: Diátaxis promises to make documentation and projects better, and the teams that work with them more successful.
pt_br: Diátaxis promete tornar documentação e projetos melhores, e os times com quem trabalham mais bem sucedidos.

source: While redesigning the `Cloudflare developer docs <https://developers.cloudflare.com>`_, this content framework became our north star for information architecture. When we weren’t sure where a new piece of content should fit in, we’d consult the framework. Our documentation is now clearer than it’s ever been, both for readers and contributors.
pt_br: Quando estávamos redesenhando a `documentação para desenvolvedores da Clouflare <https://developers.cloudflare.com>`_, o conteúdo desse framework se tornou nosso norte para estruturar a informação. Quando nós não tínhamos certeza sobre aonde um novo pedaço de conteúdo deveria se encaixar, nós consultamos o framework. Agora nossa documentação está mais clara do que nunca, tanto para os leitores quando para os colaboradores.

source: Light-weight and easily adopted
pt_br: Leve e de fácil adaptação

source: The framework is light-weight, easy to understand and straightforward to apply. It doesn't impose implementation constraints.
pt_br: O framework é leve, fácil de entender e simples de aplicar. Ele não impõe restrições de implementação.

source: Complete and comprehensive
pt_br: Completo e abrangente

source: Diátaxis provides a comprehensive and nearly universally-applicable scheme, that has been :ref:`proven in practice across a wide variety of fields and applications <adoption>`. These include large and small, and open and proprietary documentation projects.
pt_br: Diátaxis fornece um esquema abrangente e quase que universalmente-aplicável, que tem sido :ref:`testado na prática através de uma grande variedade de adoção de aplicações e campos <adoption>`. Entre os quais inclui projetos de documentação grandes, pequenos, livres ou proprietários.

source: Video presentation
pt_br: Apresentação em vídeo

source: If you'd prefer to watch a video covering this topic, here is it (courtesy of PyCon Australia 2017).
pt_br: Se preferir assistir a um video que explica sobre esse tópico, aqui está (cortesia de PyCon Australia 2017).
