Repository: evildmp/diataxis-documentation-framework
Catalog: locales/*/LC_MESSAGES/introduction.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: The problem and the solution
pt_br: O problema e a solução

source: The problem it solves
pt_br: O problema que resolve

source: It doesn’t matter how good your product is, because **if its documentation is not good enough, people will not use it**. Even if they have to use it because they have no choice, without good documentation, they won’t use it effectively or the way you’d like them to.
pt_br: Não importa o quão bom seja produto, **se a documentação dele não for boa o suficiente, as pessoas não vão usar**. Mesmo se elas sejam obrigadas a usar por não terem escolha, sem uma boa documentação, elas não vão usar de um modo efetivo ou do jeito que gostariam que fosse.

source: Nearly everyone understands this. Nearly everyone knows that they need good documentation, and **most people try to create good documentation**. And **most people fail**.
pt_br: Quase todo mundo sabe isso. Quase todo mundo entende que precisa de uma boa documentação, e **a maioria das pessoas tentam criar uma boa documentação**. **Mas a grande parte falha**.

source: Usually, it’s not because they don’t try hard enough. Usually, it’s because they are not doing it the right way.
pt_br: Normalmente, não é por que não se esforçaram o bastante. Mas por que não estão fazendo da maneira correta.

source: This system is a way to make your documentation better, not by working harder at it, but by doing it the right way. **The right way is the easier way** - easier to write, and easier to maintain.
pt_br: Esse sistema é uma forma de melhorar a documentação, não por trabalhar pegando pesado, mas por fazer da forma certa. **A forma certa é o jeito mais fácil** - fácil de escrever e fácil de manter.

source: The 'secret'
pt_br: O 'segredo'

source: It's not actually a secret and it certainly shouldn't be: documentation needs to include and be structured around its **four different functions**: *tutorials*, *how-to guides*, *technical reference* and *explanation*. Each of them **requires a distinct mode of writing**. People working with software need these four different kinds of documentation at different times, in different circumstances - so software usually needs them all, and they should all be integrated into your documentation.
pt_br: Na verdade, não é nenhum segredo e nem deveria ser: a documentação precisa incluir e ser estruturada em torno de **quatro pilares diferentes**: *tutoriais*, *guias de como-fazer*, *referência técnica* e *explanação*. Cada uma delas **requer uma forma distinta de escrever**. Pessoas que trabalham com programação precisam desses quatro tipos diferentes de documentação em diferentes momentos, e em diferentes circustâncias - e como na área de programação geralmente se precisa de todos os quatro pilares, todos eles precisam estar integrados na sua documentação.

source: And documentation needs to be explicitly structured around them, and they all must be kept separate and distinct from each other.
pt_br: E a documentação precisa estar explicitamente organizada em torno desses quatro, e todos eles precisam ser mantidos separados e distintos uma dos outros.

source: :ref:`Tutorials <tutorials>`
pt_br: :ref:`Tutoriais <tutorials>`

source: :ref:`How-to guides <how-to>`
pt_br: :ref:`Guias de como-fazer <how-to>`

source: :ref:`Reference <reference>`
pt_br: :ref:`Referência <reference>`

source: :ref:`Explanation <explanation>`
pt_br: :ref:`Explanação <explanation>`

source: *oriented to*
pt_br: *orientado a*

source: learning
pt_br: aprendizado

source: a goal
pt_br: um objetivo

source: information
pt_br: informação

source: understanding
pt_br: entendimento

source: *must*
pt_br: *deve*

source: allow the newcomer to get started
pt_br: permite que o novato comece

source: show how to solve a specific problem
pt_br: mostra como resolver um problema específico

source: describe the machinery
pt_br: descreve o maquinário

source: explain
pt_br: explica

source: *its form*
pt_br: *de qual forma*

source: a lesson
pt_br: uma lição

source: a series of steps
pt_br: uma série de passos

source: dry description
pt_br: descrição direta

source: discursive explanation
pt_br: explicação discursiva

source: *analogy*
pt_br: *analogia*

source: teaching a small child how to cook
pt_br: ensinar uma criança a cozinhar

source: a recipe in a cookery book
pt_br: uma receita de um livro de receitas

source: a reference encyclopaedia article
pt_br: uma referência de um artigo de enciclopédia

source: an article on culinary social history
pt_br: um artigo sobre história social de culinária

source: This division makes it obvious to both author and reader what material, and what *kind* of material, goes where. It tells the author **how to write**, and **what to write**, and **where to write it**. It saves the author from wasting a great deal of time trying to wrestle the information they want to impart into a shape that makes sense, because **each of these kinds of documentation has only one job**.
pt_br: Essa divisão faz com que seja nítido para o autor e para o leitor qual, que *tipo*, e aonde o conteúdo vai. Mostra para o autor **o quê**, **onde** e **como escrever**. Isso evita que o autor perca muito tempo tentando transformar as informações que deseja transmitir em uma forma que faça sentido, porque **cada um desses tipos de documentação tem apenas uma tarefa**.

source: In fact, it’s extremely hard to maintain good documentation that doesn’t implicitly or explicitly recognise the quadrants of this scheme. The demands of each kind are different from those of the others, so **any attempt at documentation that fails to maintain this structure suffers**, as it’s pulled in different directions at once.
pt_br: Na verdade, é extremamente difícil manter uma boa documentação que não reconheça de forma implícita ou explicita os quadrantes desse esquema. As demandas de cada tipo são diferentes das outras, então **qualquer tentativa de documentação que falhe em manter essa estrutura sofre**, já que é puxado para diferentes direções ao mesmo tempo.

source: Once you understand the structure, it becomes a very useful tool for analysing existing documentation, and understanding what needs to be done to improve it.
pt_br: Depois de entender essa estrutura, ela se torna uma ferramenta muito útil para analisar uma documentação existente e entender o que precisa ser feito para melhorá-la.

source: In the following sections, each of these four parts is dealt with in detail.
pt_br: Nas seções a seguir, cada uma dessas quatro partes é tratada emdetalhe.

source: Making documentation work
pt_br: Fazendo a documentação funcionar

source: For authors
pt_br: Para os autores

source: One of the biggest headaches that documentation maintainers have to deal with is not having a clear picture of what they should be doing. They write and rewrite, but find it hard to make it fit together in satisfactory ways.
pt_br: Uma das maiores dores de cabeça com que os mantenedores de documentação tem que lidar é não ter uma imagem clara do que deveriam estar fazendo. Eles escrevem e reescrevem, mas acham difícil fazer com que tudo se encaixe de maneira satisfatória.

source: This structure resolves those questions by making clear distinctions and separations. They make documentation that is easier to write and maintain, that’s easier to use and to find one's way around in.
pt_br: Essa estrutura resolve essas questões, fazendo distinções e separações claras. Eles fazem com que a documentação seja mais fácil de escrever e de manter, e que seja mais fácil de usar e de se naveragar por ela.

source: The documentation doesn’t write itself - but it’s now possible to write it without also having to wrestle with poor fit, or unclear scope or doubt about what should be included or what style to adopt. It becomes much clearer what to write, how to write it, and where to put it.
pt_br: A documentação não se escreve sozinha - mas agora é possível escrevê-la sem também ter que lutar contra um ajuste inadequado, um escopo pouco claro, uma dúvida sobre o que deve ser incluído ou que estilo adotar. Se torna muito mais claro o que escrever, como escrever e onde colocar as coisas.

source: For readers
pt_br: Para os leitores

source: It serves users better, because for all the different phases in the cycle of their interaction with the software they will find the right kind of documentation, that serves the needs of that moment.
pt_br: Atende melhor os usuários, pois para todas as diferentes fases do ciclo de sua interação com o software eles encontrarão o tipo de documentação certa, que atenda as necessidades daquele momento.

source: Writing documentation that explicitly and distinctly addresses each of the four quadrants helps the software attract and keep more users, who will use it more effectively - and that is one of the things the creators of software want most of all.
pt_br: Escrever uma documentação que trate de forma explícita e distinta cada um dos quatro quadrantes ajuda o software a atrair e manter mais usuários, que o usarão de forma mais eficaz - e isso é uma das coisas que os criadores de software mais desejam.
